{
  "jobs": [
    {
      "title": "Junior Vue Developer",
      "type": "Contract",
      "location": "Remote",
      "description": "Entry-level Vue developer needed to assist in building dynamic single-page applications. Familiarity with Vue CLI and Vuetify is a plus.",
      "salary": "$60K - $70K",
      "company": {
        "name": "Webify",
        "description": "Webify helps businesses go digital by developing responsive and user-friendly applications with the latest technology stacks.",
        "contactEmail": "careers@webify.com",
        "contactPhone": "800-789-9872"
      },
      "id": "1"
    },
    {
      "id": "2",
      "title": "Vue Front-End Engineer",
      "type": "Full-Time",
      "location": "San Francisco, CA",
      "description": "We're looking for a Vue.js Front-End Engineer to build and maintain interactive web applications. Experience with Vue 3, Tailwind CSS, and state management is preferred.",
      "salary": "$110K - $120K",
      "company": {
        "name": "BrightTech",
        "description": "BrightTech focuses on cutting-edge web development projects for high-profile clients, fostering creativity and growth in the tech space.",
        "contactEmail": "jobs@brighttech.com",
        "contactPhone": "415-123-4567"
      }
    },
    {
      "id": "3",
      "title": "Senior Vue Developer",
      "type": "Part-Time",
      "location": "Boston, MA",
      "description": "We are seeking a talented Front-End Developer to join our team in Boston, MA. The ideal candidate will have strong skills in HTML, CSS, and JavaScript, with experience working with modern JavaScript frameworks such as Vue or Angular.",
      "salary": "$90K - $100K",
      "company": {
        "name": "NewTek Solutions",
        "description": "NewTek Solutions is a leading technology company specializing in web development and digital solutions. We pride ourselves on delivering high-quality products and services to our clients while fostering a collaborative and innovative work environment.",
        "contactEmail": "contact@teksolutions.com",
        "contactPhone": "555-555-5555"
      }
    },
    {
      "id": "4",
      "title": "Lead Vue Engineer",
      "type": "Full-Time",
      "location": "Austin, TX",
      "description": "Seeking an experienced Lead Vue Engineer to drive the development of our main product. Must have experience with large-scale Vue applications and API integration.",
      "salary": "$130K - $140K",
      "company": {
        "name": "InnovateSoft",
        "description": "InnovateSoft specializes in scalable enterprise software solutions for healthcare and finance industries.",
        "contactEmail": "hr@innovatesoft.com",
        "contactPhone": "512-456-7890"
      }
    },
    {
      "id": "5",
      "title": "Vue.js UI Developer",
      "type": "Freelance",
      "location": "Seattle, WA",
      "description": "We're hiring a Vue.js developer with a keen eye for design to create engaging user interfaces. Must have experience with CSS frameworks and component libraries.",
      "salary": "$80K - $90K",
      "company": {
        "name": "PixelCraft",
        "description": "PixelCraft is a boutique design and development agency working on user-centric web solutions.",
        "contactEmail": "hello@pixelcraft.com",
        "contactPhone": "206-123-4567"
      }
    },
    {
      "id": "6",
      "title": "Mid-Level Vue Developer",
      "type": "Part-Time",
      "location": "Chicago, IL",
      "description": "Join our team to develop innovative web platforms using Vue and GraphQL. Previous experience with Vite and modern build tools is required.",
      "salary": "$85K - $95K",
      "company": {
        "name": "NextGen Apps",
        "description": "NextGen Apps delivers digital products for tech startups looking to disrupt their industries.",
        "contactEmail": "jobs@nextgenapps.com",
        "contactPhone": "312-654-3210"
      }
    },
    {
      "id": "7",
      "title": "Vue.js Developer",
      "type": "Remote",
      "location": "New York, NY",
      "description": "Remote Vue.js Developer needed to work on a large eCommerce platform. Experience with Vuex and payment gateway integration is preferred.",
      "salary": "$100K - $110K",
      "company": {
        "name": "CommerceTech",
        "description": "CommerceTech is revolutionizing the online shopping experience with scalable and innovative web technologies.",
        "contactEmail": "recruitment@commercetech.com",
        "contactPhone": "212-987-6543"
      }
    },
    {
      "id": "8",
      "title": "Vue Full-Stack Developer",
      "type": "Full-Time",
      "location": "Denver, CO",
      "description": "Looking for a Full-Stack Vue Developer with backend experience in Node.js and MongoDB. A passion for clean code and great UX is essential.",
      "salary": "$105K - $115K",
      "company": {
        "name": "CloudSphere",
        "description": "CloudSphere builds cloud-native applications for enterprise-level clients across multiple sectors.",
        "contactEmail": "team@cloudsphere.com",
        "contactPhone": "720-321-6547"
      }
    },
    {
      "id": "9",
      "title": "Vue Front-End Consultant",
      "type": "Consultant",
      "location": "Los Angeles, CA",
      "description": "Consultant role for a front-end expert with Vue 3 knowledge. You will advise on performance optimization and design scalability.",
      "salary": "$120K - $130K",
      "company": {
        "name": "DigitalEdge",
        "description": "DigitalEdge partners with enterprises to modernize their web presence and improve user experience.",
        "contactEmail": "contact@digitaledge.com",
        "contactPhone": "310-654-7891"
      }
    },
    {
      "id": "10",
      "title": "Vue Mobile App Developer",
      "type": "Full-Time",
      "location": "Miami, FL",
      "description": "Vue Mobile App Developer needed to build hybrid mobile applications using Vue and Capacitor. Prior experience with PWA development is a plus.",
      "salary": "$95K - $105K",
      "company": {
        "name": "Appify Labs",
        "description": "Appify Labs focuses on creating modern mobile and web applications for small to medium-sized businesses.",
        "contactEmail": "apply@appifylabs.com",
        "contactPhone": "305-123-4567"
      }
    },
    {
      "id": "4ee3",
      "title": "Full Stack Developer (Vue.js & Laravel)",
      "type": "Full-Time",
      "location": "California",
      "description": "We are seeking an experienced Full Stack Developer with a strong proficiency in Vue.js and Laravel. As a Full Stack Developer, you will be responsible for designing, developing, and maintaining web applications and ensuring their seamless integration between front-end and back-end systems.\n\nKey Responsibilities:\n\n    Develop and maintain complex web applications using Vue.js for the front end and Laravel for the back end.\n\n    Design user-friendly and responsive interfaces with Vue.js, ensuring optimal performance across devices.\n\n    Build and manage RESTful APIs with Laravel for data management and integration with front-end applications.\n\n    Collaborate with cross-functional teams, including designers and product managers, to define technical requirements and deliver exceptional user experiences.\n\n    Write clean, well-documented, and efficient code following best practices.\n\n    Troubleshoot, test, and optimize web applications to improve functionality and performance.\n\n    Stay up-to-date with the latest web development technologies and trends to ensure the best solutions for the company’s projects.\n\nRequired Skills and Qualifications:\n\n    5+ years of experience as a Full Stack Developer.\n\n    Strong expertise in Vue.js and Laravel.\n\n    Experience with front-end technologies such as HTML5, CSS3, and JavaScript.\n\n    Experience with PostgreSQL for database management.\n\n    Proficiency in creating and maintaining RESTful APIs.\n\n    Experience with version control systems, such as Git.\n\n    Knowledge of agile development methodologies.\n\n    Strong problem-solving and debugging skills.\n\n    Ability to work independently and collaboratively in a team environment.\n\nPreferred Qualifications:\n\n    Experience with AWS for cloud infrastructure management and deployment.\n\n    Familiarity with Docker and containerization.\n\n    Experience with automated testing and CI/CD pipelines.\n",
      "salary": "$90K - $100K",
      "company": {
        "name": "ABC Labs",
        "description": "ABC Labs is a leading global professional services company that helps the world’s leading businesses, governments and other organizations build their digital core, optimize their operations, accelerate revenue growth and enhance citizen services",
        "contactEmail": "abclabs@abclabs.com",
        "contactPhone": ""
      }
    }
  ],
  "users": [
    {
      "id": "1",
      "name": "John Doe",
      "email": "y9qQd@example.com",
      "phone": "555-555-5555",
      "role": "admin",
      "password": "password"
    }
  ]
}